camel-bus-cdi/src/test/resources/xml/soap-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Header/>
   <soapenv:Body>
      <orders:order xmlns:orders="urn:switchyard-quickstart:cdi-bus:1.0">
         <orderId>PO-19838-XYZ</orderId>
         <itemId>BUTTER</itemId>
         <quantity>200</quantity>
      </orders:order>
   </soapenv:Body>
</soapenv:Envelope>
